syllabus-Fa17.tex
% Created 2017-08-20 Sun 13:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\geometry{margin=1.0in}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage[labelfont=bf]{caption}
\usepackage{setspace}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2017 W.\ F.\ Schneider}
\rfoot{\thepage}
\title{University of Notre Dame\\Advanced Chemical Engineering Thermodynamics\\(CBE 60553)}
\author{Prof. William F.\ Schneider}
\usepackage{titlesec}
\titlespacing*{\section}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\titlespacing*{\subsection}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\titlespacing*{\subsubsection}
{0pt}{0.4\baselineskip}{0.1\baselineskip}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CBE 60553 Syllabus}
\begin{document}

\begin{OPTIONS}
\end{OPTIONS}

\begin{center}
\textsc{\Large Advanced Chemical Engineering Thermodynamics (CBE 60553)}\\University of Notre Dame, Fall 2017
\end{center}
\begin{tabular*}{\textwidth}{@{\extracolsep{\fill}}l r}
\hline
Prof.\ Bill Schneider & Classroom: 115 O'Shag\\
Office: 123b Cushing & Lecture MWF 10:30-11:20\\
\email{wschneider@nd.edu}, phone 574-631-8754 & \\
\hline
\end{tabular*}

\section{Thermodynamics}
\label{sec:org1145d74}
Thermodynamics is the most complete and elegant of all the physical theories we have to describe the world around us. To paraphrase Einstein, it is the only theory that we are certain will never change. It is beautiful in its simplicity yet surprisingly challenging to apply in practice. It is central to all elements of Chemical Engineering, and for that reason most essential for you have a firm foundation in.

In this class we will take a fundamental approach to thermodynamics. Our goal is for you to understand the underlying concepts well, so that you can apply them to your own problems of interest. We begin with a refresher on the basic mathematical structure of thermodynamics. We’ll then delve into the immutable microscopic underpinnings of thermodynamics. That microscopic picture is the bridge to understanding the thermodynamic properties of gases, liquids, and mixtures. Lastly, we will explore the thermodynamics of reactions, phase change, and non-equilibrium behavior.

I strongly encourage you to keep up with the reading and homework and to bring up questions in class. Don’t be bashful: if you don’t understand something, chances are that many of your classmates (and quite possibly your instructor!) don’t either.

\section{Texts}
\label{sec:org17b45ee}
\subsection{Primary}
\label{sec:orgddfa651}
\begin{itemize}
\item De Pablo and Schieber, \emph{Molecular Engineering Thermodynamics}, Cambridge 2014
\end{itemize}

\subsection{Supporting}
\label{sec:org2f68d7e}
\begin{itemize}
\item McQuarrie and Simon, \emph{Molecular Thermodynamics}, University Science Books, 1999;
\item H. B. Callen, \emph{Thermodynamics and an Introduction to Thermostatistics} 2nd ed., Wiley 1985;
\item Tester and Modell, \emph{Thermodynamics and its Applications}, Prentice-Hall, 1997
\end{itemize}

\section{Web}
\label{sec:org71441f4}
This syllabus, reading assignment, the homework assignments and solutions, a summary of the lecture schedule, and a \textbf{detailed course outline} are available on the web at \url{https://github.com/wmfschneider/CBE60553}.

\section{Format}
\label{sec:orgbc3518e}
The topics will be presented in a series of self-contained lectures as
outlined on the website. Lecture notes for each lecture will be posted
on-line. Attendance is expected, and you should be prepared to ask
and answer questions.

\section{Homework}
\label{sec:orgfc958b5}
Nine problem sets will be distributed during the semester and will be due at the beginning of class on dates to be announced. The problem sets will be designed to reinforce your knowledge and ability to apply the course material.  \textbf{Assignments turned in late will automatically lose 20\%, and those turned in after the solutions are posted will not be accepted.}  Your lowest score on homework will be dropped.  You may discuss the homework with your classmates, but \textbf{what you turn in must be your own work.}

Homework will in general require some computations. You may write out solutions by hand. Alternatively, homework will also be distributed as \href{https://ipython.org/notebook.html}{iPython notebooks}, a format that allows you to solve problems using Python within the notebook.
\section{Homework Defense}
\label{sec:orgb470c73}
To help me get to know you and how you are doing with the course, after each homework assignment two of you will be chosen at random to meet with me one-on-one to defend your homework answers.

\section{Grading}
\label{sec:org2a58156}
Grades will be based on the homework (30\%), two in-class exams (40\%), and a cumulative final (30\%).

\section{Academic honesty}
\label{sec:org83e1fff}
Should go without saying. Any cheating or misrepresenting of work as your own will be dealt with according to the Honor Code policies of the University. I reserve the right to relocate any students during an examination at my discretion.

\section{Professional courtesy}
\label{sec:orge73d63a}
As a courtesy to the instructor and your classmates, please refrain from
texting, web browsing, tweeting, updating, or using your phone or laptop for any
purpose during class time.  If you must use an electronic device, excuse
yourself from class.

\section{Office hours}
\label{sec:org2672737}
The instructor will be available Wednesdays 3:30-4:30 or by appointment to discuss the course and homework.
\end{document}